HTRamsey/STM32_ETH_Test/Libs/FreeRTOS-Plus-TCP/portable/NetworkInterface.c
    #if ipconfigIS_DISABLED( ipconfigETHERNET_DRIVER_FILTERS_FRAME_TYPES )
        #warning "Consider enabling ipconfigETHERNET_DRIVER_FILTERS_FRAME_TYPES for NetworkInterface"
    #endif

	/* TODO: There should be a universal check for use in network interfaces, similar to eConsiderFrameForProcessing.
	 * So, don't use this macro, and filter anyways in the mean time. */
	/* #if ipconfigIS_DISABLED( ipconfigETHERNET_DRIVER_FILTERS_PACKETS )
			#warning "Consider enabling ipconfigETHERNET_DRIVER_FILTERS_PACKETS for NetworkInterface"
	#endif */

    #if ipconfigIS_DISABLED( ipconfigUSE_LINKED_RX_MESSAGES )
        #warning "Consider enabling ipconfigUSE_LINKED_RX_MESSAGES for NetworkInterface"
    #endif

#endif

/*---------------------------------------------------------------------------*/
/*===========================================================================*/
/*                            Macros & Definitions                           */
/*===========================================================================*/
/*---------------------------------------------------------------------------*/

#if ( defined( __MPU_PRESENT ) && ( __MPU_PRESENT == 1U ) )
    #define niEMAC_MPU
    #define niEMAC_MPU_ENABLED      ( _FLD2VAL( MPU_CTRL_ENABLE, MPU->CTRL ) != 0 )
#endif

#if ( defined( __DCACHE_PRESENT ) && ( __DCACHE_PRESENT == 1U ) )
    #define niEMAC_CACHEABLE
    #define niEMAC_CACHE_ENABLED    ( _FLD2VAL( SCB_CCR_DC, SCB->CCR ) != 0 )
    #define niEMAC_CACHE_MAINTENANCE ( ipconfigIS_DISABLED( niEMAC_USE_MPU ) && niEMAC_CACHE_ENABLED )
    #ifdef __SCB_DCACHE_LINE_SIZE
        #define niEMAC_DATA_ALIGNMENT    __SCB_DCACHE_LINE_SIZE
    #else
        #define niEMAC_DATA_ALIGNMENT    32U
    #endif
#else
    #define niEMAC_DATA_ALIGNMENT   portBYTE_ALIGNMENT
#endif

#define niEMAC_DATA_ALIGNMENT_MASK   ( niEMAC_DATA_ALIGNMENT - 1U )
#define niEMAC_BUF_ALIGNMENT        32U
#define niEMAC_BUF_ALIGNMENT_MASK   ( niEMAC_BUF_ALIGNMENT - 1U )

#define niEMAC_DATA_BUFFER_SIZE     ( ( ipTOTAL_ETHERNET_FRAME_SIZE + niEMAC_DATA_ALIGNMENT_MASK ) & ~niEMAC_DATA_ALIGNMENT_MASK )
#define niEMAC_TOTAL_BUFFER_SIZE    ( ( ( niEMAC_DATA_BUFFER_SIZE + ipBUFFER_PADDING ) + niEMAC_BUF_ALIGNMENT_MASK ) & ~niEMAC_BUF_ALIGNMENT_MASK )

#if defined( niEMAC_STM32FX )

    typedef __PACKED_STRUCT xTDES0 {
        uint32_t
            OWN : 1,
            IC : 1,
            LS : 1,
            FS : 1,
            DC : 1,
            DP : 1,
            TTSE : 1,
            RESERVED0 : 1,
            CIC : 2,
            TER : 1,
            TCH : 1,
            RESERVED1 : 2,
            TTSS : 1,
            IHE : 1,
            ES : 1,
            JT : 1,
            FF : 1,
            IPE : 1,
            LCA : 1,
            NC : 1,
            LCO : 1,
            EC : 1,
            VF : 1,
            CC : 4,
            ED : 1,
            UF : 1,
            DB : 1;
    } TDES0_t;

    typedef __PACKED_STRUCT xTDES1 {
        uint32_t
            RESERVED0 : 3,
            TBS2 : 13,
            RESERVED1 : 3,
            TBS1 : 13;
    } TDES1_t;

    typedef __PACKED_STRUCT xTDES2 {
        uint32_t
            TBAP1 : 32;
    } TDES2_t;

    typedef __PACKED_STRUCT xTDES3 {
        uint32_t
            TBAP2 : 32;
    } TDES3_t;

    typedef __PACKED_STRUCT xTDES6 {
        uint32_t
            TTSL : 32;
    } TDES6_t;

    typedef __PACKED_STRUCT xTDES7 {
        uint32_t
            TTSH : 32;
    } TDES7_t;


    typedef __PACKED_STRUCT xRDES0 {
        uint32_t
            OWN : 1,
            AFM : 1,
            FL : 14,
            ES : 1,
            DE : 1,
            SAF : 1,
            LE : 1,
            OE : 1,
            VLAN : 1,
            FS : 1,
            LS : 1,
            IPHCE_TSV : 1,
            LCO : 1,
            FT : 1,
            RWT : 1,
            RE : 1,
            DBE : 1,
            CE : 1,
            PCE_ESA : 1;
    } RDES0_t;

    typedef __PACKED_STRUCT xRDES1 {
        uint32_t
            DIC : 1,
            RESERVED0 : 2,
            RBS2 : 13,
            RER : 1,
            RCH : 1,
            RESERVED1 : 1,
            RBS1 : 13;
    } RDES1_t;

    typedef __PACKED_STRUCT xRDES2 {
        uint32_t
            RBAP1_RTSL : 32;
    } RDES2_t;

    typedef __PACKED_STRUCT xRDES3 {
        uint32_t
            RBAP2_RTSL : 32;
    } RDES3_t;

    typedef __PACKED_STRUCT xRDES4 {
        uint32_t
            RESERVED0 : 18,
            PV : 13,
            PTP : 1,
            PMT : 3,
            IPV6PR : 1,
            IPV4PR : 1,
            IPCB : 1,
            IPPE : 1,
            IPHE : 1,
            IPPT : 3;
    } RDES4_t;

    typedef __PACKED_STRUCT xRDES6 {
        uint32_t
            RTSL : 32;
    } RDES6_t;

    typedef __PACKED_STRUCT xRDES7 {
        uint32_t
            RTSH : 32;
    } RDES7_t;

    #define TDES0( TDESC ) ( * ( volatile TDES0_t * ) TDESC->DESC0 )
    #define TDES1( TDESC ) ( * ( volatile TDES1_t * ) TDESC->DESC1 )
    #define TDES2( TDESC ) ( * ( volatile TDES2_t * ) TDESC->DESC2 )
    #define TDES3( TDESC ) ( * ( volatile TDES3_t * ) TDESC->DESC3 )
    #define TDES6( TDESC ) ( * ( volatile TDES4_t * ) TDESC->DESC6 )
    #define TDES7( TDESC ) ( * ( volatile TDES5_t * ) TDESC->DESC7 )

    #define RDES0( RDESC ) ( * ( volatile RDES0_t * ) RDESC->DESC0 )
    #define RDES1( RDESC ) ( * ( volatile RDES1_t * ) RDESC->DESC1 )
    #define RDES2( RDESC ) ( * ( volatile RDES2_t * ) RDESC->DESC2 )
    #define RDES3( RDESC ) ( * ( volatile RDES3_t * ) RDESC->DESC3 )
    #define RDES4( RDESC ) ( * ( volatile RDES4_t * ) RDESC->DESC4 )
    #define RDES6( RDESC ) ( * ( volatile RDES4_t * ) RDESC->DESC6 )
    #define RDES7( RDESC ) ( * ( volatile RDES5_t * ) RDESC->DESC7 )


	#ifdef ETH_GIANT_PACKET
		#undef ETH_GIANT_PACKET
	#endif
	#define ETH_GIANT_PACKET ETH_DMARXDESC_IPV4HCE

	#ifdef ETH_DMA_RX_BUFFER_UNAVAILABLE_FLAG
		#undef ETH_DMA_RX_BUFFER_UNAVAILABLE_FLAG
	#endif
	#define ETH_DMA_RX_BUFFER_UNAVAILABLE_FLAG ETH_DMASR_RBUS

