HTRamsey/STM32_ETH_Test/Libs/FreeRTOS-Plus-TCP/portable/NetworkInterface.c
	#ifdef ETH_DMA_TX_BUFFER_UNAVAILABLE_FLAG
		#undef ETH_DMA_TX_BUFFER_UNAVAILABLE_FLAG
	#endif
	#define ETH_DMA_TX_BUFFER_UNAVAILABLE_FLAG ETH_DMASR_TBUS

	/* Note: ETH_CTRLPACKETS_BLOCK_ALL is incorrectly defined in HAL ETH Driver as of F7 V1.17.1 && F4 V1.28.0 */
	#ifdef ETH_CTRLPACKETS_BLOCK_ALL
		#undef ETH_CTRLPACKETS_BLOCK_ALL
	#endif
	#define ETH_CTRLPACKETS_BLOCK_ALL ETH_MACFFR_PCF_BlockAll

#elif defined( niEMAC_STM32HX )

	#ifdef ETH_DMA_TX_BUFFER_UNAVAILABLE_FLAG
		#undef ETH_DMA_TX_BUFFER_UNAVAILABLE_FLAG
	#endif
	#define ETH_DMA_TX_BUFFER_UNAVAILABLE_FLAG ETH_DMACSR_TBU

	#define ETH_DMA_TX_ERRORS_MASK ETH_DMACSR_TEB
	#define ETH_DMA_RX_ERRORS_MASK ETH_DMACSR_REB

    #ifdef ETH_DMARXNDESCWBF_PT
        #undef ETH_DMARXNDESCWBF_PT
    #endif
    #define ETH_DMARXNDESCWBF_PT 0x00000007U

    #ifndef ETH_IP_PAYLOAD_IGMP
        #define ETH_IP_PAYLOAD_IGMP 0x00000004U
    #endif

#endif

#define INCR_TX_DESC_INDEX( inx, offset )\
    do {\
        ( inx ) += ( offset );\
        if( ( inx ) >= ETH_TX_DESC_CNT )\
        {\
            ( inx ) = ( ( inx ) - ETH_TX_DESC_CNT );\
        }\
    } while( 0 )

#define INCR_RX_DESC_INDEX( inx, offset )\
    do {\
        ( inx ) += ( offset );\
        if( ( inx ) >= ETH_RX_DESC_CNT )\
        {\
            ( inx ) = ( ( inx ) - ETH_RX_DESC_CNT );\
        }\
    } while( 0 )

#define niEMAC_BUFS_PER_DESC 2U

/* IEEE 802.3 CRC32 polynomial - 0x04C11DB7 */
#define niEMAC_CRC_POLY 0x04C11DB7
#define niEMAC_MAC_IS_MULTICAST( MAC )  ( ( MAC[ 0 ] & 1U ) != 0 )
#define niEMAC_MAC_IS_UNICAST( MAC )    ( ( MAC[ 0 ] & 1U ) == 0 )
#define niEMAC_ADDRESS_HASH_BITS    64U
#define niEMAC_MAC_MATCH_COUNT  3U

/*---------------------------------------------------------------------------*/
/*===========================================================================*/
/*                               typedefs                                    */
/*===========================================================================*/
/*---------------------------------------------------------------------------*/

/* Interrupt events to process: reception, transmission and error handling. */
typedef enum {
    eMacEventNone = 0,
    eMacEventRx = 1 << 0,
    eMacEventTx = 1 << 1,
    eMacEventErrRx = 1 << 2,
    eMacEventErrTx = 1 << 3,
    eMacEventErrDma = 1 << 4,
    eMacEventErrEth = 1 << 5,
    eMacEventErrMac = 1 << 6,
    eMacEventAll = ( 1 << 7 ) - 1,
} eMAC_IF_EVENT;

typedef enum
{
    eMacEthInit, /* Must initialise ETH. */
    eMacPhyInit, /* Must initialise PHY. */
    eMacPhyStart, /* Must start PHY. */
    eMacTaskStart, /* Must start deferred interrupt handler task. */
    eMacEthStart, /* Must start ETH. */
    eMacInitComplete /* Initialisation was successful. */
} eMAC_INIT_STATUS_TYPE;

/* typedef struct xPhyData
{
    EthernetPhy_t xPhyObject;
    #if defined( niEMAC_STM32HX ) && ipconfigIS_ENABLED( niEMAC_USE_PHY_INT )
		union {
			lan8742_Object_t xLan8742a;
			dp83848_Object_t xDp83848;
		} xPhyInstance;
	#endif
} PhyData_t;

typedef struct xMacSrcMatchData
{
    uint8_t ucSrcMatchCounters[ niEMAC_MAC_MATCH_COUNT ];
    uint8_t uxMACEntryIndex = 0;
} MacSrcMatchData_t;

typedef struct xMacHashData
{
    uint32_t ulHashTable[ niEMAC_ADDRESS_HASH_BITS / 32 ];
    uint8_t ucAddrHashCounters[ niEMAC_ADDRESS_HASH_BITS ];
} MacHashData_t;

typedef struct xMacFilteringData
{
    MacSrcMatchData_t xSrcMatch;
    MacHashData_t xHash;
} MacFilteringData_t;

typedef struct xEMACData
{
    ETH_HandleTypeDef xEthHandle;
    ETH_DMADescTypeDef xDMADescTx[ ETH_TX_DESC_CNT ];
    ETH_DMADescTypeDef xDMADescRx[ ETH_RX_DESC_CNT ];
    EthernetPhy_t xPhyObject;
    TaskHandle_t xEMACTaskHandle;
    SemaphoreHandle_t xTxMutex, xTxDescSem;
    ETH_BufferTypeDef xTxBuffers[ niEMAC_BUFS_PER_DESC * ETH_TX_DESC_CNT ];
    BaseType_t xSwitchRequired;
    eMAC_INIT_STATUS_TYPE xMacInitStatus;
    BaseType_t xEMACIndex;
    MacFilteringData_t xMacFilteringData;
} EMACData_t; */

/* TODO: need a data structure to assist in adding/removing allowed addresses */

/*---------------------------------------------------------------------------*/
/*===========================================================================*/
/*                      Static Function Declarations                         */
/*===========================================================================*/
/*---------------------------------------------------------------------------*/

/* Network Interface Definition */
NetworkInterface_t * pxSTM32_FillInterfaceDescriptor( BaseType_t xEMACIndex, NetworkInterface_t * pxInterface );

/* Phy Hooks */
static BaseType_t prvPhyReadReg( BaseType_t xAddress, BaseType_t xRegister, uint32_t * pulValue );
static BaseType_t prvPhyWriteReg( BaseType_t xAddress, BaseType_t xRegister, uint32_t ulValue );

/* Network Interface Access Hooks */
static BaseType_t prvGetPhyLinkStatus( NetworkInterface_t * pxInterface );
static BaseType_t prvNetworkInterfaceInitialise( NetworkInterface_t * pxInterface );
static BaseType_t prvNetworkInterfaceOutput( NetworkInterface_t * pxInterface, NetworkBufferDescriptor_t * const pxDescriptor, BaseType_t xReleaseAfterSend );
static void prvAddAllowedMACAddress( NetworkInterface_t * pxInterface, const uint8_t * pucMacAddress );
static void prvRemoveAllowedMACAddress( NetworkInterface_t * pxInterface, const uint8_t * pucMacAddress );

/* EMAC Task */
static BaseType_t prvNetworkInterfaceInput( ETH_HandleTypeDef * pxEthHandle, NetworkInterface_t * pxInterface );
static __NO_RETURN portTASK_FUNCTION_PROTO( prvEMACHandlerTask, pvParameters );
static BaseType_t prvEMACTaskStart( NetworkInterface_t * pxInterface );

/* EMAC Init */
static void prvInitMacAddresses( ETH_TypeDef * const pxEthHandle, NetworkInterface_t * pxInterface );
#ifdef niEMAC_STM32HX
    static void prvInitPacketFilter( ETH_TypeDef * const pxEthHandle, const NetworkInterface_t * const pxInterface );
#endif
static BaseType_t prvPhyInit( ETH_TypeDef * const pxEthInstance, EthernetPhy_t * pxPhyObject );
static BaseType_t prvPhyStart( ETH_HandleTypeDef * pxEthHandle, NetworkInterface_t * pxInterface, EthernetPhy_t * pxPhyObject );

/* MAC Filtering Helpers */
static uint32_t prvCalcCrc32( const uint8_t * const pucMACAddr );
static uint8_t prvGetMacHashIndex( const uint8_t * const pucMACAddr );
static BaseType_t prvAddDestMACAddrMatch( ETH_TypeDef * const pxEthInstance, const uint8_t * const pucMACAddr );
static BaseType_t prvRemoveDestMACAddrMatch( ETH_TypeDef * const pxEthInstance, const uint8_t * const pucMACAddr );
static BaseType_t prvSetNewDestMACAddrMatch( ETH_TypeDef * const pxEthInstance, uint8_t ucHashIndex, const uint8_t * const pucMACAddr );
static void prvAddDestMACAddrHash( ETH_TypeDef * const pxEthInstance, uint8_t ucHashIndex );
static void prvRemoveDestMACAddrHash( ETH_TypeDef * const pxEthInstance, const uint8_t * const pucMACAddr );

/* EMAC Helpers */
static void prvReleaseTxPacket( ETH_HandleTypeDef * pxEthHandle );
static BaseType_t prvMacUpdateConfig( ETH_HandleTypeDef * pxEthHandle, EthernetPhy_t * pxPhyObject );
static void prvReleaseNetworkBufferDescriptor( NetworkBufferDescriptor_t * const pxDescriptor );
static void prvSendRxEvent( NetworkBufferDescriptor_t * const pxDescriptor );
static BaseType_t prvAcceptPacket( const NetworkBufferDescriptor_t * const pxDescriptor, uint16_t usLength );

/* Reimplemented HAL Functions */
static BaseType_t prvHAL_ETH_Init( ETH_HandleTypeDef * const pxEthHandle, NetworkInterface_t * pxInterface );
static BaseType_t prvHAL_ETH_Start_IT( ETH_HandleTypeDef * const pxEthHandle );
static BaseType_t prvHAL_ETH_Stop_IT( ETH_HandleTypeDef * const pxEthHandle );
static BaseType_t prvHAL_ETH_ReadData( ETH_HandleTypeDef * const pxEthHandle, void ** ppvBuff );
static void prvHAL_ETH_ReleaseTxPacket( ETH_HandleTypeDef * const pxEthHandle );
static void prvETH_DMATxDescListInit( ETH_HandleTypeDef * const pxEthHandle );
static void prvETH_DMARxDescListInit( ETH_HandleTypeDef * const pxEthHandle );
static void prvETH_UpdateDescriptor( ETH_HandleTypeDef * const pxEthHandle );
static void prvHAL_ETH_SetDestMACAddrMatch( ETH_TypeDef * const pxEthInstance, uint8_t ucIndex, const uint8_t * const pucMACAddr );
static void prvHAL_ETH_ClearDestMACAddrMatch( ETH_TypeDef * const pxEthInstance, uint8_t ucIndex );
static void prvHAL_ETH_SetHashTable( ETH_TypeDef * const pxEthInstance );
static void prvHAL_ETH_SetMDIOClockRange( ETH_TypeDef * const pxEthInstance );
static BaseType_t prvWaitPHYBusy( ETH_TypeDef * const pxEthInstance );
static BaseType_t prvHAL_ETH_ReadPHYRegister( ETH_TypeDef * const pxEthInstance, uint32_t ulPhyAddr, uint32_t ulPhyReg, uint32_t * pulRegValue );
static BaseType_t prvHAL_ETH_WritePHYRegister( ETH_TypeDef * const pxEthInstance, uint32_t ulPhyAddr, uint32_t ulPhyReg, uint32_t ulRegValue );

