HTRamsey/STM32_ETH_Test/Libs/FreeRTOS-Plus-TCP/portable/NetworkInterface.c
    if( pxPhyObject->xPhyProperties.ucSpeed == PHY_SPEED_100 )
    {
        SET_BIT( pxEthHandle->Instance->MACCR, ETH_MACCR_FES );
    }
    else
    {
        CLEAR_BIT( pxEthHandle->Instance->MACCR, ETH_MACCR_FES );
    }

    return xResult;
}

/*---------------------------------------------------------------------------*/

static void prvReleaseNetworkBufferDescriptor( NetworkBufferDescriptor_t * const pxDescriptor )
{
    NetworkBufferDescriptor_t * pxDescriptorToClear = pxDescriptor;
    while( pxDescriptorToClear != NULL )
    {
        #if ipconfigIS_ENABLED( ipconfigUSE_LINKED_RX_MESSAGES )
            NetworkBufferDescriptor_t * const pxNext = pxDescriptorToClear->pxNextBuffer;
        #else
            NetworkBufferDescriptor_t * const pxNext = NULL;
        #endif
        vReleaseNetworkBufferAndDescriptor( pxDescriptorToClear );
        pxDescriptorToClear = pxNext;
    };
}

/*---------------------------------------------------------------------------*/

static void prvSendRxEvent( NetworkBufferDescriptor_t * const pxDescriptor )
{
    const IPStackEvent_t xRxEvent = {
        .eEventType = eNetworkRxEvent,
        .pvData = ( void * ) pxDescriptor
    };
    if( xSendEventStructToIPTask( &xRxEvent, pdMS_TO_TICKS( niEMAC_RX_MAX_BLOCK_TIME_MS ) ) != pdPASS )
    {
        iptraceETHERNET_RX_EVENT_LOST();
        FreeRTOS_debug_printf( ( "prvSendRxEvent: xSendEventStructToIPTask failed\n" ) );
        prvReleaseNetworkBufferDescriptor( pxDescriptor );
    }
}

/*---------------------------------------------------------------------------*/

static BaseType_t prvAcceptPacket( const NetworkBufferDescriptor_t * const pxDescriptor, uint16_t usLength )
{
    BaseType_t xResult = pdFALSE;
    do
    {
        if( pxDescriptor == NULL )
        {
            iptraceETHERNET_RX_EVENT_LOST();
            FreeRTOS_debug_printf( ( "prvAcceptPacket: Null Descriptor\n" ) );
            break;
        }

        if( usLength > pxDescriptor->xDataLength )
		{
			iptraceETHERNET_RX_EVENT_LOST();
			FreeRTOS_debug_printf( ( "prvAcceptPacket: Packet size overflow\n" ) );
			break;
		}

        ETH_HandleTypeDef * pxEthHandle = &xEthHandle;

        const ETH_DMADescTypeDef * const ulRxDesc = ( const ETH_DMADescTypeDef * const ) pxEthHandle->RxDescList.RxDesc[ pxEthHandle->RxDescList.RxDescIdx ];

        #ifdef niEMAC_STM32FX
            if( READ_BIT( ulRxDesc->DESC0, ETH_DMARXDESC_ES ) != 0 )
        #elif defined( niEMAC_STM32HX )
            if( READ_BIT( ulRxDesc->DESC3, ETH_DMARXNDESCWBF_ES ) != 0 )
        #endif
        {
			#if ipconfigIS_ENABLED( niEMAC_DEBUG_ERROR )
        		prvHAL_RX_ErrorCallback( pxEthHandle );
			#endif
            iptraceETHERNET_RX_EVENT_LOST();
            FreeRTOS_debug_printf( ( "prvAcceptPacket: Rx Data Error\n" ) );
            break;
        }

		#if ipconfigIS_ENABLED( ipconfigETHERNET_DRIVER_FILTERS_FRAME_TYPES )
			if( eConsiderFrameForProcessing( pxDescriptor->pucEthernetBuffer ) != eProcessBuffer )
			{
				iptraceETHERNET_RX_EVENT_LOST();
				FreeRTOS_debug_printf( ( "prvAcceptPacket: Frame discarded\n" ) );
				break;
			}
		#endif

		#if ipconfigIS_ENABLED( ipconfigETHERNET_DRIVER_FILTERS_PACKETS )
			#ifdef niEMAC_STM32HX
				const uint32_t ulRxDesc1 = ulRxDesc->DESC1;

                if( ( ulRxDesc1 & ETH_CHECKSUM_IP_PAYLOAD_ERROR ) != 0 )
                {
                    iptraceETHERNET_RX_EVENT_LOST();
                    break;
                }

                if( ( ulRxDesc1 & ETH_CHECKSUM_IP_HEADER_ERROR ) != 0 )
                {
                    iptraceETHERNET_RX_EVENT_LOST();
                    break;
                }

				if( ( ulRxDesc1 & ETH_IP_HEADER_IPV4 ) != 0 )
				{
					/* Should be impossible if hardware filtering is implemented correctly */
					configASSERT( ipconfigIS_ENABLED( ipconfigUSE_IPv4 ) );
					#if ipconfigIS_ENABLED( ipconfigUSE_IPv4 )
					   /* prvAllowIPPacketIPv4(); */
					#endif
				}
				else if( ( ulRxDesc1 & ETH_IP_HEADER_IPV6 ) != 0 )
				{
					/* Should be impossible if hardware filtering is implemented correctly */
					configASSERT( ipconfigIS_ENABLED( ipconfigUSE_IPv6 ) );
					#if ipconfigIS_ENABLED( ipconfigUSE_IPv6 )
						/* prvAllowIPPacketIPv6(); */
					#endif
				}

				const uint32_t ulPacketType = ulRxDesc1 & ETH_DMARXNDESCWBF_PT;
				if( ulPacketType == ETH_IP_PAYLOAD_UNKNOWN )
				{
					iptraceETHERNET_RX_EVENT_LOST();
					break;
				}
				else if( ulPacketType == ETH_IP_PAYLOAD_UDP )
				{
					/* prvProcessUDPPacket(); */
				}
				else if( ulPacketType == ETH_IP_PAYLOAD_ICMPN )
				{
					#if ipconfigIS_DISABLED( ipconfigREPLY_TO_INCOMING_PINGS ) && ipconfigIS_DISABLED( ipconfigSUPPORT_OUTGOING_PINGS )
						iptraceETHERNET_RX_EVENT_LOST();
						break;
					#else
						/* ProcessICMPPacket(); */
					#endif
				}
				else if( ulPacketType == ETH_IP_PAYLOAD_TCP )
				{
					/* Should be impossible if hardware filtering is implemented correctly */
					configASSERT( ipconfigIS_ENABLED( ipconfigUSE_TCP ) );
					#if ipconfigIS_ENABLED( ipconfigUSE_TCP )
						/* xProcessReceivedTCPPacket() */
					#endif
				}
                else if( ulPacketType == ETH_IP_PAYLOAD_IGMP )
                {

                }
			#endif

			/* TODO: Create a eConsiderPacketForProcessing */
            if( eConsiderPacketForProcessing( pxDescriptor->pucEthernetBuffer ) != eProcessBuffer )
            {
            	iptraceETHERNET_RX_EVENT_LOST();
                FreeRTOS_debug_printf( ( "prvAcceptPacket: Packet discarded\n" ) );
                break;
            }
        #endif

        xResult = pdTRUE;

    } while( pdFALSE );

    return xResult;
}

/*---------------------------------------------------------------------------*/
/*===========================================================================*/
/*                              IRQ Handlers                                 */
/*===========================================================================*/
/*---------------------------------------------------------------------------*/

void ETH_IRQHandler( void )
{
    traceISR_ENTER();

    ETH_HandleTypeDef * pxEthHandle = &xEthHandle;

