HTRamsey/STM32_ETH_Test/Libs/FreeRTOS-Plus-TCP/portable/NetworkInterface.c
/*---------------------------------------------------------------------------*/

void HAL_ETH_TxFreeCallback( uint32_t * pulBuff )
{
    NetworkBufferDescriptor_t * const pxNetworkBuffer = ( NetworkBufferDescriptor_t * ) pulBuff;
    prvReleaseNetworkBufferDescriptor( pxNetworkBuffer );
    ( void ) xSemaphoreGive( xTxDescSem );
}

/*---------------------------------------------------------------------------*/
/*===========================================================================*/
/*                        Reimplemented HAL Functions                        */
/*===========================================================================*/
/*---------------------------------------------------------------------------*/

static BaseType_t prvHAL_ETH_Init( ETH_HandleTypeDef * const pxEthHandle, NetworkInterface_t * pxInterface )
{
    configASSERT( pxEthHandle != NULL );
    BaseType_t xResult = pdPASS;

    pxEthHandle->Instance = ETH;

    pxEthHandle->Init.MediaInterface = ipconfigIS_ENABLED( niEMAC_USE_RMII ) ? HAL_ETH_RMII_MODE : HAL_ETH_MII_MODE;

    pxEthHandle->Init.RxBuffLen = niEMAC_DATA_BUFFER_SIZE;
    /* configASSERT( pxEthHandle->Init.RxBuffLen <= ETH_MAX_PACKET_SIZE ); */
    configASSERT( pxEthHandle->Init.RxBuffLen % 4U == 0 );

    /* #ifdef niEMAC_STM32HX
        configASSERT( ETH_TX_DESC_CNT % 4 == 0 );
        configASSERT( ETH_RX_DESC_CNT % 4 == 0 );
    #endif */
    static ETH_DMADescTypeDef xDMADescTx[ ETH_TX_DESC_CNT ] __ALIGNED( portBYTE_ALIGNMENT ) __attribute__( ( section( niEMAC_TX_DESC_SECTION ) ) );
    static ETH_DMADescTypeDef xDMADescRx[ ETH_RX_DESC_CNT ] __ALIGNED( portBYTE_ALIGNMENT ) __attribute__( ( section( niEMAC_RX_DESC_SECTION ) ) );
    pxEthHandle->Init.TxDesc = xDMADescTx;
    pxEthHandle->Init.RxDesc = xDMADescRx;
    ( void ) memset( &xDMADescTx, 0, sizeof( xDMADescTx ) );
    ( void ) memset( &xDMADescRx, 0, sizeof( xDMADescRx ) );

    if( pxEthHandle->gState == HAL_ETH_STATE_RESET )
    {
        pxEthHandle->gState = HAL_ETH_STATE_BUSY;
        HAL_ETH_MspInit( pxEthHandle );

        #ifdef niEMAC_STM32FX
            configASSERT( __HAL_RCC_ETH_IS_CLK_ENABLED() != 0 );
        #elif defined( STM32H5 )
            configASSERT( __HAL_RCC_ETH_IS_CLK_ENABLED() != 0 );
            configASSERT( __HAL_RCC_ETHTX_IS_CLK_ENABLED() != 0 );
            configASSERT( __HAL_RCC_ETHRX_IS_CLK_ENABLED() != 0 );
        #elif defined( STM32H7)
            configASSERT( __HAL_RCC_ETH1MAC_IS_CLK_ENABLED() != 0 );
            configASSERT( __HAL_RCC_ETH1TX_IS_CLK_ENABLED() != 0 );
            configASSERT( __HAL_RCC_ETH1RX_IS_CLK_ENABLED() != 0 );
        #endif

        #ifdef niEMAC_CACHEABLE
            if( niEMAC_CACHE_ENABLED != 0 )
            {
                #ifdef niEMAC_MPU
                    configASSERT( niEMAC_MPU_ENABLED != 0 );
                #else
                    configASSERT( pdFALSE );
                #endif
                /* _FLD2VAL( SCB_CCSIDR_LINESIZE, SCB->CCSIDR ) */
            }
        #endif

        #ifdef configPRIO_BITS
            const uint32_t ulPrioBits = configPRIO_BITS;
        #else
            const uint32_t ulPrioBits = __NVIC_PRIO_BITS;
        #endif
        const uint32_t ulPriority = NVIC_GetPriority( ETH_IRQn ) << ( 8U - ulPrioBits );
        if( ulPriority < configMAX_SYSCALL_INTERRUPT_PRIORITY )
        {
            FreeRTOS_debug_printf( ( "prvEthConfigInit: Incorrectly set ETH_IRQn priority\n" ) );
            NVIC_SetPriority( ETH_IRQn, configMAX_SYSCALL_INTERRUPT_PRIORITY >> ( 8U - ulPrioBits ) );
        }
        if( NVIC_GetEnableIRQ( ETH_IRQn ) == 0 )
        {
            FreeRTOS_debug_printf( ( "prvEthConfigInit: ETH_IRQn was not enabled by application\n" ) );
            HAL_NVIC_EnableIRQ( ETH_IRQn );
        }
    }

    #if defined( niEMAC_STM32FX ) || defined( STM32H7 )
        __HAL_RCC_SYSCFG_CLK_ENABLE();
    #elif defined( STM32H5 )
        __HAL_RCC_SBS_CLK_ENABLE();
    #endif

    #ifdef niEMAC_STM32FX
        #if ipconfigIS_ENABLED( niEMAC_USE_RMII )
            SET_BIT( SYSCFG->PMC, SYSCFG_PMC_MII_RMII_SEL );
        #else
            CLEAR_BIT( SYSCFG->PMC, SYSCFG_PMC_MII_RMII_SEL );
        #endif
    #elif defined( STM32H7 )
        #if ipconfigIS_ENABLED( niEMAC_USE_RMII )
            MODIFY_REG( SYSCFG->PMCR, SYSCFG_PMCR_EPIS_SEL, SYSCFG_PMCR_EPIS_SEL_2 );
        #else
            CLEAR_BIT( SYSCFG->PMCR, SYSCFG_PMCR_EPIS_SEL );
        #endif
    #elif defined( STM32H5 )
        #if ipconfigIS_ENABLED( niEMAC_USE_RMII )
            MODIFY_REG( SBS->PMCR, SBS_PMCR_ETH_SEL_PHY, SBS_PMCR_ETH_SEL_PHY_2 );
        #else
            CLEAR_BIT( SBS->PMCR, SBS_PMCR_ETH_SEL_PHY );
        #endif
    #endif

    TimeOut_t xPhyTimer;
    vTaskSetTimeOutState( &xPhyTimer );
    TickType_t xPhyRemaining = pdMS_TO_TICKS( 500U );
    #ifdef niEMAC_STM32FX
        SET_BIT( pxEthHandle->Instance->DMABMR, ETH_DMABMR_SR );
        while( READ_BIT( pxEthHandle->Instance->DMABMR, ETH_DMABMR_SR ) != 0 )
    #elif defined( niEMAC_STM32HX )
        SET_BIT( pxEthHandle->Instance->DMAMR, ETH_DMAMR_SWR );
        while( READ_BIT( pxEthHandle->Instance->DMAMR, ETH_DMAMR_SWR ) != 0 )
    #endif
    {
        if( xTaskCheckForTimeOut( &xPhyTimer, &xPhyRemaining ) != pdFALSE )
        {
            pxEthHandle->ErrorCode = HAL_ETH_ERROR_TIMEOUT;
            pxEthHandle->gState = HAL_ETH_STATE_ERROR;
            xResult = pdFAIL;
            break;
        }
        else
        {
            vTaskDelay( pdMS_TO_TICKS( 1 ) );
        }
    }

    if( xResult == pdPASS )
    {
        prvHAL_ETH_SetMDIOClockRange( pxEthHandle->Instance );
        uint32_t ulReg;
        #ifdef niEMAC_STM32HX
            WRITE_REG( pxEthHandle->Instance->MAC1USTCR, ( HAL_RCC_GetHCLKFreq() / 1000000U ) - 1U );

            ulReg = READ_REG( pxEthHandle->Instance->MACCR );
            SET_BIT( ulReg, ETH_MACCR_ACS );
            CLEAR_BIT( ulReg, ETH_MACCR_CST | ETH_MACCR_DR );
            #if ipconfigIS_ENABLED( ipconfigDRIVER_INCLUDED_RX_IP_CHECKSUM )
                SET_BIT( ulReg, ETH_MACCR_IPC );
            #else
                CLEAR_BIT( ulReg, ETH_MACCR_IPC );
            #endif
            /* CLEAR_BIT( ulReg, ETH_MACCR_ARP;
            WRITE_REG( pxEthHandle->Instance->MACARPAR, ulSourceIPAddress );
            SET_BIT( ulReg, ETH_MACCR_ARP ); */
            WRITE_REG( pxEthHandle->Instance->MACCR, ulReg );

            ulReg = READ_REG( pxEthHandle->Instance->MACECR );
            WRITE_REG( pxEthHandle->Instance->MACECR, ulReg );

