HTRamsey/STM32_ETH_Test/Libs/FreeRTOS-Plus-TCP/portable/NetworkInterface.c
            ulReg = READ_REG( pxEthHandle->Instance->MACWTR );
            WRITE_REG( pxEthHandle->Instance->MACWTR, ulReg );

            ulReg = READ_REG( pxEthHandle->Instance->MACTFCR );
            WRITE_REG( pxEthHandle->Instance->MACTFCR, ulReg );

            ulReg = READ_REG( pxEthHandle->Instance->MACRFCR );
            WRITE_REG( pxEthHandle->Instance->MACRFCR, ulReg );

            ulReg = READ_REG( pxEthHandle->Instance->MTLTQOMR );
            WRITE_REG( pxEthHandle->Instance->MTLTQOMR, ulReg );

            ulReg = READ_REG( pxEthHandle->Instance->MTLRQOMR );
            WRITE_REG( pxEthHandle->Instance->MTLRQOMR, ulReg );

            ulReg = READ_REG( pxEthHandle->Instance->DMAMR );
            WRITE_REG( pxEthHandle->Instance->DMAMR, ulReg );

            ulReg = READ_REG( pxEthHandle->Instance->DMASBMR );
            WRITE_REG( pxEthHandle->Instance->DMASBMR, ulReg );

            ulReg = READ_REG( pxEthHandle->Instance->DMACCR );
            MODIFY_REG( ulReg, ETH_DMACCR_DSL, ETH_DMACCR_DSL_64BIT );
            /* #if ipconfigIS_ENABLED( ipconfigUSE_TCP ) && ipconfigIS_ENABLED( niEMAC_TCP_SEGMENTATION )
                MODIFY_REG( ulReg, ETH_DMACCR_MSS, ipconfigTCP_MSS );
            #endif */
            WRITE_REG( pxEthHandle->Instance->DMACCR, ulReg );

            ulReg = READ_REG( pxEthHandle->Instance->DMACTCR );
            SET_BIT( ulReg, ETH_DMACTCR_OSP );
            /* #if ipconfigIS_ENABLED( ipconfigUSE_TCP ) && ipconfigIS_ENABLED( niEMAC_TCP_SEGMENTATION )
                SET_BIT( ulReg, ETH_DMACTCR_TSE );
            #endif */
            WRITE_REG( pxEthHandle->Instance->DMACTCR, ulReg );

            ulReg = READ_REG( pxEthHandle->Instance->DMACRCR );
            configASSERT( pxEthHandle->Init.RxBuffLen % 4U == 0 );
            MODIFY_REG( ulReg, ETH_DMACRCR_RBSZ, pxEthHandle->Init.RxBuffLen << 1 );
            WRITE_REG( pxEthHandle->Instance->DMACRCR, ulReg );
        #else
            ulReg = READ_REG( pxEthHandle->Instance->MACCR );
            SET_BIT( ulReg, ETH_MACCR_DM | ETH_MACCR_FES | ETH_MACCR_APCS );
            #if ipconfigIS_ENABLED( ipconfigDRIVER_INCLUDED_RX_IP_CHECKSUM )
                SET_BIT( ulReg, ETH_MACCR_IPCO );
            #else
                CLEAR_BIT( ulReg, ETH_MACCR_IPCO );
            #endif
            #ifdef ETH_MACCR_CSTF
                CLEAR_BIT( ulReg, ETH_MACCR_CSTF );
            #endif
            CLEAR_BIT( ulReg, ETH_MACCR_WD | ETH_MACCR_JD | ETH_MACCR_TE | ETH_MACCR_RE | ETH_MACCR_CSD | ETH_MACCR_RD | ETH_MACCR_LM | ETH_MACCR_ROD | ETH_MACCR_DC );
            MODIFY_REG( ulReg, ETH_MACCR_IFG, ETH_MACCR_IFG_96Bit );
            MODIFY_REG( ulReg, ETH_MACCR_BL, ETH_MACCR_BL_10 );
            WRITE_REG( pxEthHandle->Instance->MACCR, ulReg );

            ulReg = READ_REG( pxEthHandle->Instance->MACFCR );
            CLEAR_BIT( ulReg, ETH_MACFCR_ZQPD | ETH_MACFCR_UPFD | ETH_MACFCR_TFCE | ETH_MACFCR_RFCE | ETH_MACFCR_FCBBPA );
            MODIFY_REG( ulReg, ETH_MACFCR_PT, 0U );
            MODIFY_REG( ulReg, ETH_MACFCR_PLT, ETH_MACFCR_PLT_Minus4 );
            WRITE_REG( pxEthHandle->Instance->MACFCR, ulReg );

            ulReg = READ_REG( pxEthHandle->Instance->DMAOMR );
            SET_BIT( ulReg,  ETH_DMAOMR_RSF | ETH_DMAOMR_TSF | ETH_DMAOMR_OSF );
            CLEAR_BIT( ulReg, ETH_DMAOMR_DTCEFD | ETH_DMAOMR_DFRF | ETH_DMAOMR_FEF | ETH_DMAOMR_FUGF | ETH_DMAOMR_FTF | ETH_DMAOMR_ST | ETH_DMAOMR_SR );
            MODIFY_REG( ulReg, ETH_DMAOMR_TTC, ETH_DMAOMR_TTC_64Bytes );
            MODIFY_REG( ulReg, ETH_DMAOMR_RTC, ETH_DMAOMR_RTC_64Bytes );
            WRITE_REG( pxEthHandle->Instance->DMAOMR, ulReg );

            ulReg = READ_REG( pxEthHandle->Instance->DMABMR );
            SET_BIT( ulReg, ETH_DMABMR_FB | ETH_DMABMR_AAB | ETH_DMABMR_USP );
            #if ipconfigIS_ENABLED( ipconfigDRIVER_INCLUDED_TX_IP_CHECKSUM ) || ipconfigIS_ENABLED( ipconfigDRIVER_INCLUDED_RX_IP_CHECKSUM )
                SET_BIT( ulReg, ETH_DMABMR_EDE );
            #else
                CLEAR_BIT( ulReg, ETH_DMABMR_EDE );
            #endif
            CLEAR_BIT( ulReg, ETH_DMABMR_MB | ETH_DMABMR_FPM | ETH_DMABMR_DA | ETH_DMABMR_SR );
            MODIFY_REG( ulReg, ETH_DMABMR_RDP, ETH_DMABMR_RDP_32Beat );
            MODIFY_REG( ulReg, ETH_DMABMR_RTPR, ETH_DMABMR_RTPR_1_1 );
            MODIFY_REG( ulReg, ETH_DMABMR_PBL, ETH_DMABMR_PBL_32Beat );
            MODIFY_REG( ulReg, ETH_DMABMR_DSL, 0U );
            WRITE_REG( pxEthHandle->Instance->DMABMR, ulReg );
        #endif

        prvETH_DMATxDescListInit( pxEthHandle );
        prvETH_DMARxDescListInit( pxEthHandle );

        prvInitMacAddresses( pxEthHandle->Instance, pxInterface );

        #ifdef niEMAC_STM32HX
            prvInitPacketFilter( pxEthHandle->Instance, pxInterface );
        #endif

        pxEthHandle->ErrorCode = HAL_ETH_ERROR_NONE;
        pxEthHandle->gState = HAL_ETH_STATE_READY;
    }

    return HAL_OK;
}

/*---------------------------------------------------------------------------*/

static BaseType_t prvHAL_ETH_Start_IT( ETH_HandleTypeDef * const pxEthHandle )
{
    BaseType_t xResult = pdFAIL;

    if( pxEthHandle->gState == HAL_ETH_STATE_READY )
    {
        pxEthHandle->gState = HAL_ETH_STATE_BUSY;

        pxEthHandle->RxDescList.ItMode = 1U;
        #ifdef niEMAC_STM32FX
            SET_BIT( pxEthHandle->Instance->MACIMR, ETH_MACIMR_TSTIM | ETH_MACIMR_PMTIM );
            SET_BIT( pxEthHandle->Instance->MMCRIMR, ETH_MMCRIMR_RGUFM | ETH_MMCRIMR_RFAEM | ETH_MMCRIMR_RFCEM );
            SET_BIT( pxEthHandle->Instance->MMCTIMR, ETH_MMCTIMR_TGFM | ETH_MMCTIMR_TGFMSCM | ETH_MMCTIMR_TGFSCM );
        #elif defined( niEMAC_STM32HX )
            SET_BIT( pxEthHandle->Instance->MMCRIMR, ETH_MMCRIMR_RXLPITRCIM | ETH_MMCRIMR_RXLPIUSCIM | ETH_MMCRIMR_RXUCGPIM | ETH_MMCRIMR_RXALGNERPIM | ETH_MMCRIMR_RXCRCERPIM );
            SET_BIT( pxEthHandle->Instance->MMCTIMR, ETH_MMCTIMR_TXLPITRCIM | ETH_MMCTIMR_TXLPIUSCIM | ETH_MMCTIMR_TXGPKTIM | ETH_MMCTIMR_TXMCOLGPIM | ETH_MMCTIMR_TXSCOLGPIM );
        #endif

        pxEthHandle->RxDescList.RxBuildDescCnt = ETH_RX_DESC_CNT;

        prvETH_UpdateDescriptor( pxEthHandle );

        SET_BIT( pxEthHandle->Instance->MACCR, ETH_MACCR_TE | ETH_MACCR_RE );

        #ifdef niEMAC_STM32FX
            SET_BIT( pxEthHandle->Instance->DMAOMR, ETH_DMAOMR_FTF | ETH_DMAOMR_ST | ETH_DMAOMR_SR );
            CLEAR_BIT( pxEthHandle->Instance->DMASR, ( ETH_DMASR_TPS | ETH_DMASR_RPS ) );
            __HAL_ETH_DMA_ENABLE_IT( pxEthHandle, ( ETH_DMAIER_NISE | ETH_DMAIER_RIE | ETH_DMAIER_TIE | ETH_DMAIER_FBEIE | ETH_DMAIER_AISE | ETH_DMAIER_RBUIE ) );
        #elif defined( niEMAC_STM32HX )
            SET_BIT( pxEthHandle->Instance->MTLTQOMR, ETH_MTLTQOMR_FTQ );
            SET_BIT( pxEthHandle->Instance->DMACTCR, ETH_DMACTCR_ST );
            SET_BIT( pxEthHandle->Instance->DMACRCR, ETH_DMACRCR_SR );
            CLEAR_BIT( pxEthHandle->Instance->DMACSR, ( ETH_DMACSR_TPS | ETH_DMACSR_RPS ) );
            __HAL_ETH_DMA_ENABLE_IT( pxEthHandle, ( ETH_DMACIER_NIE | ETH_DMACIER_RIE | ETH_DMACIER_TIE | ETH_DMACIER_FBEE | ETH_DMACIER_AIE | ETH_DMACIER_RBUE ) );
        #endif

        pxEthHandle->gState = HAL_ETH_STATE_STARTED;
    }

    if( pxEthHandle->gState == HAL_ETH_STATE_STARTED )
    {
    	xResult = pdPASS;
    }

    return xResult;
}

