HTRamsey/STM32_ETH_Test/Libs/FreeRTOS-Plus-TCP/portable/NetworkInterface.c
/*---------------------------------------------------------------------------*/

static BaseType_t prvHAL_ETH_Stop_IT( ETH_HandleTypeDef * const pxEthHandle )
{
    BaseType_t xResult = pdFAIL;

    if( pxEthHandle->gState == HAL_ETH_STATE_STARTED )
    {
        pxEthHandle->gState = HAL_ETH_STATE_BUSY;

        #ifdef niEMAC_STM32FX
            __HAL_ETH_DMA_DISABLE_IT( pxEthHandle, ( ETH_DMAIER_NISE | ETH_DMAIER_RIE | ETH_DMAIER_TIE | ETH_DMAIER_FBEIE | ETH_DMAIER_AISE | ETH_DMAIER_RBUIE ) );
            CLEAR_BIT( pxEthHandle->Instance->DMAOMR, ETH_DMAOMR_ST | ETH_DMAOMR_SR );
            SET_BIT( pxEthHandle->Instance->DMAOMR, ETH_DMAOMR_FTF );
        #elif defined( niEMAC_STM32HX )
            __HAL_ETH_DMA_DISABLE_IT( pxEthHandle, ( ETH_DMACIER_NIE | ETH_DMACIER_RIE | ETH_DMACIER_TIE | ETH_DMACIER_FBEE | ETH_DMACIER_AIE | ETH_DMACIER_RBUE ) );
            CLEAR_BIT( pxEthHandle->Instance->DMACTCR, ETH_DMACTCR_ST | ETH_DMACRCR_SR );
            SET_BIT( pxEthHandle->Instance->MTLTQOMR, ETH_MTLTQOMR_FTQ );
        #endif
        CLEAR_BIT( pxEthHandle->Instance->MACCR, ETH_MACCR_RE | ETH_MACCR_TE );

        uint8_t descindex;
        for( descindex = 0; descindex < ETH_RX_DESC_CNT; ++descindex )
        {
            ETH_DMADescTypeDef * const dmarxdesc = ( ETH_DMADescTypeDef * const ) pxEthHandle->RxDescList.RxDesc[ descindex ];
            #ifdef niEMAC_STM32FX
                SET_BIT( dmarxdesc->DESC1, ETH_DMARXDESC_DIC );
            #elif defined( niEMAC_STM32HX )
                CLEAR_BIT( dmarxdesc->DESC3, ETH_DMARXNDESCRF_IOC);
            #endif
        }

        pxEthHandle->RxDescList.ItMode = 0U;

        pxEthHandle->gState = HAL_ETH_STATE_READY;

        xResult = pdPASS;
    }

    return xResult;
}

/*---------------------------------------------------------------------------*/

static BaseType_t prvHAL_ETH_ReadData( ETH_HandleTypeDef * const pxEthHandle, void ** ppvBuff )
{
    configASSERT( ppvBuff != NULL );
    configASSERT( pxEthHandle->gState == HAL_ETH_STATE_STARTED );

    BaseType_t xResult = pdFAIL;

    uint8_t rxdataready = 0U;
    ETH_RxDescListTypeDef * const dmarxdesclist = &( pxEthHandle->RxDescList );
    uint32_t descidx = dmarxdesclist->RxDescIdx;
    ETH_DMADescTypeDef * dmarxdesc = ( ETH_DMADescTypeDef * ) dmarxdesclist->RxDesc[ descidx ];
    const uint32_t desccntmax = ETH_RX_DESC_CNT - dmarxdesclist->RxBuildDescCnt;
    uint32_t desccnt = 0U;

    #ifdef niEMAC_STM32FX
        while( ( READ_BIT( dmarxdesc->DESC0, ETH_DMARXDESC_OWN ) == 0U ) && ( desccnt < desccntmax ) && ( rxdataready == 0U ) )
    #elif defined( niEMAC_STM32HX )
        while( ( READ_BIT( dmarxdesc->DESC3, ETH_DMARXNDESCWBF_OWN ) == 0U ) && ( desccnt < desccntmax ) && ( rxdataready == 0U ) )
    #endif
    {
        #ifdef niEMAC_STM32FX
            const BaseType_t xFirstDescriptor = ( READ_BIT( dmarxdesc->DESC0, ETH_DMARXDESC_FS ) != 0U );
        #elif defined( niEMAC_STM32HX )
            const BaseType_t xFirstDescriptor = ( READ_BIT( dmarxdesc->DESC3, ETH_DMARXNDESCWBF_FD ) != 0U );
        #endif
        if( ( xFirstDescriptor == pdTRUE ) || ( dmarxdesclist->pRxStart != NULL ) )
        {
            if( xFirstDescriptor == pdTRUE )
            {
                dmarxdesclist->RxDescCnt = 0;
                dmarxdesclist->RxDataLength = 0;
            }

            uint32_t bufflength = pxEthHandle->Init.RxBuffLen;
            #ifdef niEMAC_STM32FX
                if( READ_BIT( dmarxdesc->DESC0, ETH_DMARXDESC_LS ) != 0U )
                {
                    bufflength = ( READ_BIT( dmarxdesc->DESC0, ETH_DMARXDESC_FL ) >> 16U ) - 4U;
                    dmarxdesclist->pRxLastRxDesc = dmarxdesc->DESC0;
                    rxdataready = 1;
                }
            #elif defined( niEMAC_STM32HX )
                if( READ_BIT( dmarxdesc->DESC3, ETH_DMARXNDESCWBF_LD ) != 0U )
                {
                    bufflength = READ_BIT( dmarxdesc->DESC3, ETH_DMARXNDESCWBF_PL ) - dmarxdesclist->RxDataLength;
                    dmarxdesclist->pRxLastRxDesc = dmarxdesc->DESC3;
                    rxdataready = 1;
                }
            #endif

            #ifdef niEMAC_STM32FX
                WRITE_REG( dmarxdesc->BackupAddr0, dmarxdesc->DESC2 );
            #endif
            HAL_ETH_RxLinkCallback( &dmarxdesclist->pRxStart, &dmarxdesclist->pRxEnd, ( uint8_t * ) dmarxdesc->BackupAddr0, ( uint16_t ) bufflength );
            ++( dmarxdesclist->RxDescCnt );
            dmarxdesclist->RxDataLength += bufflength;

            dmarxdesc->BackupAddr0 = 0;
        }

        INCR_RX_DESC_INDEX( descidx, 1U );
        dmarxdesc = ( ETH_DMADescTypeDef * ) dmarxdesclist->RxDesc[ descidx ];
        ++desccnt;
    }

    dmarxdesclist->RxBuildDescCnt += desccnt;
    if( dmarxdesclist->RxBuildDescCnt != 0U )
    {
        prvETH_UpdateDescriptor( pxEthHandle );
    }

    dmarxdesclist->RxDescIdx = descidx;

    if( rxdataready == 1U )
    {
        *ppvBuff = dmarxdesclist->pRxStart;
        dmarxdesclist->pRxStart = NULL;
        xResult = pdPASS;
    }

    return xResult;
}

/*---------------------------------------------------------------------------*/

static void prvHAL_ETH_ReleaseTxPacket( ETH_HandleTypeDef * const pxEthHandle )
{
    ETH_TxDescListTypeDef * const dmatxdesclist = &( pxEthHandle->TxDescList );
    uint32_t numOfBuf = dmatxdesclist->BuffersInUse;
    uint32_t idx = dmatxdesclist->releaseIndex;
    uint8_t pktTxStatus = 1U;

    while( ( numOfBuf != 0U ) && ( pktTxStatus != 0U ) )
    {
        uint8_t pktInUse = 1U;
        --numOfBuf;
        if( dmatxdesclist->PacketAddress[ idx ] == NULL )
        {
            idx = ( idx + 1U ) & ( ETH_TX_DESC_CNT - 1U );
            pktInUse = 0U;
        }

        if( pktInUse != 0U )
        {
            #ifdef niEMAC_STM32FX
                if( ( pxEthHandle->Init.TxDesc[ idx ].DESC0 & ETH_DMATXDESC_OWN ) == 0U )
            #elif defined( niEMAC_STM32HX )
                 if( ( pxEthHandle->Init.TxDesc[ idx ].DESC3 & ETH_DMATXNDESCRF_OWN ) == 0U )
            #endif
            {
                HAL_ETH_TxFreeCallback( dmatxdesclist->PacketAddress[ idx ] );
                dmatxdesclist->PacketAddress[ idx ] = NULL;
                idx = ( idx + 1U ) & ( ETH_TX_DESC_CNT - 1U );
                dmatxdesclist->BuffersInUse = numOfBuf;
                dmatxdesclist->releaseIndex = idx;
            }
            else
            {
                pktTxStatus = 0U;
            }
        }
    }
}

