HTRamsey/STM32_ETH_Test/Libs/FreeRTOS-Plus-TCP/portable/NetworkInterface.c
/*---------------------------------------------------------------------------*/

static void prvETH_UpdateDescriptor( ETH_HandleTypeDef * const pxEthHandle )
{
    uint8_t allocStatus = 1U;
    ETH_RxDescListTypeDef * pxRxDescList = &pxEthHandle->RxDescList;
    uint32_t descidx = pxRxDescList->RxBuildDescIdx;
    uint32_t desccount = pxRxDescList->RxBuildDescCnt;
    ETH_DMADescTypeDef * dmarxdesc = ( ETH_DMADescTypeDef * ) pxRxDescList->RxDesc[ descidx ];

    while( ( desccount > 0U ) && ( allocStatus != 0U ) )
    {
        if( READ_REG( dmarxdesc->BackupAddr0 ) == 0U )
        {
            uint8_t * buff = NULL;
            HAL_ETH_RxAllocateCallback( &buff );
            if( buff == NULL )
            {
                allocStatus = 0U;
            }
            else
            {
                WRITE_REG( dmarxdesc->BackupAddr0, ( uint32_t ) buff );
                #ifdef niEMAC_STM32FX
                    WRITE_REG( dmarxdesc->DESC2, ( uint32_t ) buff );
                #elif defined( niEMAC_STM32HX )
                    WRITE_REG( dmarxdesc->DESC0, ( uint32_t ) buff );
                #endif
            }
        }

        if( allocStatus != 0U )
        {
            if( pxRxDescList->ItMode == 0U )
            {
                #ifdef niEMAC_STM32FX
                    WRITE_REG( dmarxdesc->DESC1, ETH_DMARXDESC_DIC | pxEthHandle->Init.RxBuffLen | ETH_DMARXDESC_RCH );
                #elif defined( niEMAC_STM32HX )
                    WRITE_REG( dmarxdesc->DESC3, ETH_DMARXNDESCRF_OWN | ETH_DMARXNDESCRF_BUF1V );
                #endif
            }
            else
            {
                #ifdef niEMAC_STM32FX
                    WRITE_REG( dmarxdesc->DESC1, pxEthHandle->Init.RxBuffLen | ETH_DMARXDESC_RCH );
                #elif defined( niEMAC_STM32HX )
                    WRITE_REG( dmarxdesc->DESC3, ETH_DMARXNDESCRF_OWN | ETH_DMARXNDESCRF_BUF1V | ETH_DMARXNDESCRF_IOC );
                #endif
            }

            #ifdef niEMAC_STM32FX
                /* __DMB(); */
                SET_BIT( dmarxdesc->DESC0, ETH_DMARXDESC_OWN );
            #endif

            INCR_RX_DESC_INDEX( descidx, 1U );
            dmarxdesc = ( ETH_DMADescTypeDef * ) pxRxDescList->RxDesc[ descidx ];
            --desccount;
        }
    }

    if( pxRxDescList->RxBuildDescCnt != desccount )
    {
        #ifdef niEMAC_STM32FX
            CLEAR_REG( pxEthHandle->Instance->DMARPDR );
        #elif defined( niEMAC_STM32HX )
            CLEAR_REG( pxEthHandle->Instance->DMACRDTPR );
        #endif
        pxRxDescList->RxBuildDescIdx = descidx;
        pxRxDescList->RxBuildDescCnt = desccount;
    }
}

/*---------------------------------------------------------------------------*/

static void prvETH_DMATxDescListInit( ETH_HandleTypeDef * const pxEthHandle )
{
    uint32_t i;
    for( i = 0; i < ETH_TX_DESC_CNT; ++i )
    {
        ETH_DMADescTypeDef * const dmatxdesc = &( pxEthHandle->Init.TxDesc[ i ] );

        CLEAR_REG( dmatxdesc->DESC0 );
        CLEAR_REG( dmatxdesc->DESC1 );
        CLEAR_REG( dmatxdesc->DESC2 );
        CLEAR_REG( dmatxdesc->DESC3 );

        WRITE_REG( pxEthHandle->TxDescList.TxDesc[ i ], ( uint32_t ) dmatxdesc );

		#ifdef niEMAC_STM32FX
        	SET_BIT( dmatxdesc->DESC0, ETH_DMATXDESC_TCH );
		#elif defined( niEMAC_STM32HX )

		#endif

        if( i < ( ETH_TX_DESC_CNT - 1U ) )
        {
            WRITE_REG( dmatxdesc->DESC3, ( uint32_t ) &( pxEthHandle->Init.TxDesc[ i + 1U ] ) );
        }
        else
        {
            WRITE_REG( dmatxdesc->DESC3, ( uint32_t ) &( pxEthHandle->Init.TxDesc[ 0 ] ) );
        }


        #if ipconfigIS_ENABLED( ipconfigDRIVER_INCLUDED_TX_IP_CHECKSUM )
			#ifdef niEMAC_STM32FX
            	SET_BIT( dmatxdesc->DESC0, ETH_DMATXDESC_CHECKSUMTCPUDPICMPFULL );
			#elif defined( niEMAC_STM32HX )

			#endif
        #endif
    }

    pxEthHandle->TxDescList.CurTxDesc = 0;

    #ifdef niEMAC_STM32FX
        WRITE_REG( pxEthHandle->Instance->DMATDLAR, ( uint32_t ) &( pxEthHandle->Init.TxDesc[ 0 ] ) );
    #elif defined( niEMAC_STM32HX )
        WRITE_REG( pxEthHandle->Instance->DMACTDRLR, ETH_TX_DESC_CNT - 1U );
        WRITE_REG( pxEthHandle->Instance->DMACTDLAR, ( uint32_t ) &( pxEthHandle->Init.TxDesc[ 0 ] ) );
        WRITE_REG( pxEthHandle->Instance->DMACTDTPR, ( uint32_t ) &( pxEthHandle->Init.TxDesc[ 0 ] ) );
    #endif
}

/*---------------------------------------------------------------------------*/

static void prvETH_DMARxDescListInit( ETH_HandleTypeDef * const pxEthHandle )
{
    uint32_t i;
    for( i = 0; i < ETH_RX_DESC_CNT; ++i )
    {
        ETH_DMADescTypeDef * const dmarxdesc = &( pxEthHandle->Init.RxDesc[ i ] );

        CLEAR_REG( dmarxdesc->DESC0 );
        CLEAR_REG( dmarxdesc->DESC1 );
        CLEAR_REG( dmarxdesc->DESC2 );
        CLEAR_REG( dmarxdesc->DESC3 );
        CLEAR_REG( dmarxdesc->BackupAddr0 );
        CLEAR_REG( dmarxdesc->BackupAddr1 );

		#ifdef niEMAC_STM32FX
			SET_BIT( dmarxdesc->DESC0, ETH_DMARXDESC_OWN );
			SET_BIT( dmarxdesc->DESC1, ETH_DMARXDESC_RCH | pxEthHandle->Init.RxBuffLen );
		#elif defined( niEMAC_STM32HX )

		#endif

        WRITE_REG( pxEthHandle->RxDescList.RxDesc[ i ], ( uint32_t ) dmarxdesc );

        if( i < ( ETH_RX_DESC_CNT - 1U ) )
        {
            WRITE_REG( dmarxdesc->DESC3, ( uint32_t ) &( pxEthHandle->Init.RxDesc[ i + 1U ] ) );
        }
        else
        {
            WRITE_REG( dmarxdesc->DESC3, ( uint32_t ) &( pxEthHandle->Init.RxDesc[ 0 ] ) );
        }
    }

    CLEAR_REG( pxEthHandle->RxDescList.RxDescIdx );
    CLEAR_REG( pxEthHandle->RxDescList.RxDescCnt );
    CLEAR_REG( pxEthHandle->RxDescList.RxBuildDescIdx );
    CLEAR_REG( pxEthHandle->RxDescList.RxBuildDescCnt );
    CLEAR_REG( pxEthHandle->RxDescList.ItMode );

    #ifdef niEMAC_STM32FX
        WRITE_REG( pxEthHandle->Instance->DMARDLAR, ( uint32_t ) &( pxEthHandle->Init.RxDesc[ 0 ] ) );
    #elif defined( niEMAC_STM32HX )
        WRITE_REG( pxEthHandle->Instance->DMACRDRLR, ETH_RX_DESC_CNT - 1U );
        WRITE_REG( pxEthHandle->Instance->DMACRDLAR, ( uint32_t ) &( pxEthHandle->Init.RxDesc[ 0 ] ) );
        WRITE_REG( pxEthHandle->Instance->DMACRDTPR, ( uint32_t ) &( pxEthHandle->Init.RxDesc[ ETH_RX_DESC_CNT - 1U ] ) );
    #endif
}

