HTRamsey/STM32_ETH_Test/Libs/FreeRTOS-Plus-TCP/portable/NetworkInterface.c
/*---------------------------------------------------------------------------*/

/* Needed since HAL Driver only provides source matching */
static void prvHAL_ETH_SetDestMACAddrMatch( ETH_TypeDef * const pxEthInstance, uint8_t ucIndex, const uint8_t * const pucMACAddr )
{
    configASSERT( ucIndex < niEMAC_MAC_MATCH_COUNT );
    const uint32_t ulMacAddrHigh = ( pucMACAddr[ 5 ] << 8 ) | ( pucMACAddr[ 4 ] );
    const uint32_t ulMacAddrLow = ( pucMACAddr[ 3 ] << 24 ) | ( pucMACAddr[ 2 ] << 16 ) | ( pucMACAddr[ 1 ] << 8 ) | ( pucMACAddr[ 0 ] );

    /* MACA0HR/MACA0LR reserved for the primary MAC-address. */
    const uint32_t ulMacRegHigh = ( ( uint32_t ) &( pxEthInstance->MACA1HR ) + ( 8 * ucIndex ) );
    const uint32_t ulMacRegLow = ( ( uint32_t ) &( pxEthInstance->MACA1LR ) + ( 8 * ucIndex ) );
    WRITE_REG( * ( __IO uint32_t * ) ulMacRegHigh, ETH_MACA1HR_AE | ulMacAddrHigh );
    WRITE_REG( * ( __IO uint32_t * ) ulMacRegLow, ulMacAddrLow );
}

/*---------------------------------------------------------------------------*/

static void prvHAL_ETH_ClearDestMACAddrMatch( ETH_TypeDef * const pxEthInstance, uint8_t ucIndex )
{
    configASSERT( ucIndex < niEMAC_MAC_MATCH_COUNT );
    const uint32_t ulMacRegHigh = ( ( uint32_t ) &( pxEthInstance->MACA1HR ) + ( 8 * ucIndex ) );
    const uint32_t ulMacRegLow = ( ( uint32_t ) &( pxEthInstance->MACA1LR ) + ( 8 * ucIndex ) );
    CLEAR_REG( * ( __IO uint32_t * ) ulMacRegHigh );
    CLEAR_REG( * ( __IO uint32_t * ) ulMacRegLow );
}

/*---------------------------------------------------------------------------*/

static void prvHAL_ETH_SetHashTable( ETH_TypeDef * const pxEthInstance )
{
    #ifdef niEMAC_STM32FX
        WRITE_REG( pxEthInstance->MACHTHR, ulHashTable[ 0 ] );
        WRITE_REG( pxEthInstance->MACHTLR, ulHashTable[ 1 ] );
    #elif defined( niEMAC_STM32HX )
        WRITE_REG( pxEthInstance->MACHT0R, ulHashTable[ 0 ] );
        WRITE_REG( pxEthInstance->MACHT1R, ulHashTable[ 1 ] );
    #endif
}

/*---------------------------------------------------------------------------*/

static void prvHAL_ETH_SetMDIOClockRange( ETH_TypeDef * const pxEthInstance )
{
    const uint32_t ulHClk = HAL_RCC_GetHCLKFreq();

    if( ( ulHClk >= 20000000U ) && ( ulHClk < 35000000U ) )
    {
        #ifdef niEMAC_STM32FX
            MODIFY_REG( pxEthInstance->MACMIIAR, ETH_MACMIIAR_CR, ETH_MACMIIAR_CR_Div16 );
        #elif defined( niEMAC_STM32HX )
            MODIFY_REG( pxEthInstance->MACMDIOAR, ETH_MACMDIOAR_CR, ETH_MACMDIOAR_CR_DIV16 );
        #endif
    }
    else if( ( ulHClk >= 35000000U ) && ( ulHClk < 60000000U ) )
    {
        #ifdef niEMAC_STM32FX
            MODIFY_REG( pxEthInstance->MACMIIAR, ETH_MACMIIAR_CR, ETH_MACMIIAR_CR_Div26 );
        #elif defined( niEMAC_STM32HX )
            MODIFY_REG( pxEthInstance->MACMDIOAR, ETH_MACMDIOAR_CR, ETH_MACMDIOAR_CR_DIV26 );
        #endif
    }
    else if( ( ulHClk >= 60000000U ) && ( ulHClk < 100000000U ) )
    {
        #ifdef niEMAC_STM32FX
            MODIFY_REG( pxEthInstance->MACMIIAR, ETH_MACMIIAR_CR, ETH_MACMIIAR_CR_Div42 );
        #elif defined( niEMAC_STM32HX )
            MODIFY_REG( pxEthInstance->MACMDIOAR, ETH_MACMDIOAR_CR, ETH_MACMDIOAR_CR_DIV42 );
        #endif
    }
    else if( ( ulHClk >= 100000000U ) && ( ulHClk < 150000000U ) )
    {
        #ifdef niEMAC_STM32FX
            MODIFY_REG( pxEthInstance->MACMIIAR, ETH_MACMIIAR_CR, ETH_MACMIIAR_CR_Div62 );
        #elif defined( niEMAC_STM32HX )
            MODIFY_REG( pxEthInstance->MACMDIOAR, ETH_MACMDIOAR_CR, ETH_MACMDIOAR_CR_DIV62 );
        #endif
    }
    else if(  ( ulHClk >= 150000000U ) && ( ulHClk <= 250000000U ) )
    {
        #ifdef niEMAC_STM32FX
            MODIFY_REG( pxEthInstance->MACMIIAR, ETH_MACMIIAR_CR, ETH_MACMIIAR_CR_Div102 );
        #elif defined( niEMAC_STM32HX )
            MODIFY_REG( pxEthInstance->MACMDIOAR, ETH_MACMDIOAR_CR, ETH_MACMDIOAR_CR_DIV102 );
        #endif
    }
    else
    {
        #ifdef niEMAC_STM32HX
            MODIFY_REG( pxEthInstance->MACMDIOAR, ETH_MACMDIOAR_CR, ETH_MACMDIOAR_CR_DIV124 );
        #endif
    }
}

/*---------------------------------------------------------------------------*/

static BaseType_t prvWaitPHYBusy( ETH_TypeDef * const pxEthInstance )
{
    BaseType_t xResult = pdPASS;

    TimeOut_t xPhyTimer;
    vTaskSetTimeOutState( &xPhyTimer );
    TickType_t xPhyRemaining = pdMS_TO_TICKS( 2U );
    #ifdef niEMAC_STM32FX
        while( READ_BIT( pxEthInstance->MACMIIAR, ETH_MACMIIAR_MB ) != 0 )
    #elif defined( niEMAC_STM32HX )
        while( READ_BIT( pxEthInstance->MACMDIOAR, ETH_MACMDIOAR_MB ) != 0 )
    #endif
    {
        if( xTaskCheckForTimeOut( &xPhyTimer, &xPhyRemaining ) != pdFALSE )
        {
            xResult = pdFAIL;
            break;
        }
        else
        {
            vTaskDelay( pdMS_TO_TICKS( 1 ) );
        }
    }

    return xResult;
}

/*---------------------------------------------------------------------------*/

static BaseType_t prvHAL_ETH_ReadPHYRegister( ETH_TypeDef * const pxEthInstance, uint32_t ulPhyAddr, uint32_t ulPhyReg, uint32_t * pulRegValue )
{
    BaseType_t xResult = pdFAIL;

    #ifdef niEMAC_STM32FX
        uint32_t ulReg = READ_REG( pxEthInstance->MACMIIAR );
        if( READ_BIT( ulReg, ETH_MACMIIAR_MB ) == 0 )
        {
            MODIFY_REG( ulReg, ETH_MACMIIAR_PA, _VAL2FLD( ETH_MACMIIAR_PA, ulPhyAddr ) );
            MODIFY_REG( ulReg, ETH_MACMIIAR_MR, _VAL2FLD( ETH_MACMIIAR_MR, ulPhyReg ) );
            CLEAR_BIT( ulReg, ETH_MACMIIAR_MW );
            SET_BIT( ulReg, ETH_MACMIIAR_MB );
            WRITE_REG( pxEthInstance->MACMIIAR, ulReg);
            if( prvWaitPHYBusy( pxEthInstance ) == pdPASS )
            {
                xResult = pdPASS;
            }
            WRITE_REG( *pulRegValue, _FLD2VAL( ETH_MACMIIDR_MD, pxEthInstance->MACMIIDR ) );
        }
    #elif defined( niEMAC_STM32HX )
        uint32_t ulReg = READ_REG( pxEthInstance->MACMDIOAR );
        if( READ_BIT( ulReg, ETH_MACMDIOAR_MB ) == 0 )
        {
            MODIFY_REG( ulReg, ETH_MACMDIOAR_PA, _VAL2FLD( ETH_MACMDIOAR_PA, ulPhyAddr ) );
            MODIFY_REG( ulReg, ETH_MACMDIOAR_RDA, _VAL2FLD( ETH_MACMDIOAR_RDA, ulPhyReg ) );
            MODIFY_REG( ulReg, ETH_MACMDIOAR_MOC, ETH_MACMDIOAR_MOC_WR );
            SET_BIT( ulReg, ETH_MACMDIOAR_MB);
            WRITE_REG( pxEthInstance->MACMDIOAR, ulReg );
            if( prvWaitPHYBusy( pxEthInstance ) == pdPASS )
            {
                xResult = pdPASS;
            }
            WRITE_REG( *pulRegValue, _FLD2VAL( ETH_MACMDIODR_MD, pxEthInstance->MACMDIODR ) );
        }
    #endif

    return xResult;
}

