HTRamsey/STM32_ETH_Test/Libs/FreeRTOS-Plus-TCP/portable/NetworkInterface.c
/*---------------------------------------------------------------------------*/

static BaseType_t prvHAL_ETH_WritePHYRegister( ETH_TypeDef * const pxEthInstance, uint32_t ulPhyAddr, uint32_t ulPhyReg, uint32_t ulRegValue )
{
    BaseType_t xResult = pdPASS;

    #ifdef niEMAC_STM32FX
        uint32_t ulReg = READ_REG( pxEthInstance->MACMIIAR );
        if( READ_BIT( ulReg, ETH_MACMIIAR_MB ) == 0 )
        {
            MODIFY_REG( ulReg, ETH_MACMIIAR_PA, _VAL2FLD( ETH_MACMIIAR_PA, ulPhyAddr ) );
            MODIFY_REG( ulReg, ETH_MACMIIAR_MR, _VAL2FLD( ETH_MACMIIAR_MR, ulPhyReg ) );
            SET_BIT( ulReg, ETH_MACMIIAR_MW | ETH_MACMIIAR_MB );
            WRITE_REG( pxEthInstance->MACMIIDR, _VAL2FLD( ETH_MACMIIDR_MD, ulRegValue ) );
            WRITE_REG( pxEthInstance->MACMIIAR, ulReg);
    #elif defined( niEMAC_STM32HX )
        uint32_t ulReg = READ_REG( pxEthInstance->MACMDIOAR );
        if( READ_BIT( ulReg, ETH_MACMDIOAR_MB ) == 0 )
        {
            MODIFY_REG( ulReg, ETH_MACMDIOAR_PA, _VAL2FLD( ETH_MACMDIOAR_PA, ulPhyAddr ) );
            MODIFY_REG( ulReg, ETH_MACMDIOAR_RDA, _VAL2FLD( ETH_MACMDIOAR_RDA, ulPhyReg ) );
            MODIFY_REG( ulReg, ETH_MACMDIOAR_MOC, ETH_MACMDIOAR_MOC_WR );
            SET_BIT( ulReg, ETH_MACMDIOAR_MB );
            WRITE_REG( pxEthInstance->MACMDIODR, _VAL2FLD( ETH_MACMDIODR_MD, ulRegValue ) );
            WRITE_REG( pxEthInstance->MACMDIOAR, ulReg );
    #endif
        if( prvWaitPHYBusy( pxEthInstance ) == pdPASS )
        {
            xResult = pdPASS;
        }
    }

    return xResult;
}

/*---------------------------------------------------------------------------*/
/*===========================================================================*/
/*                      		Debugging                         			 */
/*===========================================================================*/
/*---------------------------------------------------------------------------*/

#if ipconfigIS_ENABLED( niEMAC_DEBUG_ERROR )

static void prvHAL_RX_ErrorCallback( ETH_HandleTypeDef * pxEthHandle )
{
    const uint32_t xRxLastDesc = pxEthHandle->RxDescList.pRxLastRxDesc;
    if( ( xRxLastDesc & ETH_DMARXDESC_ES ) != 0 )
    {
        if( ( pxEthHandle->Init.MediaInterface == HAL_ETH_MII_MODE ) && ( READ_BIT( xRxLastDesc, ETH_DRIBBLE_BIT_ERROR ) != 0 ) )
        {
        	static size_t uxRxDBError = 0;
        	++uxRxDBError;
        }
        if( READ_BIT( xRxLastDesc, ETH_RECEIVE_ERROR ) != 0 )
        {
        	static size_t uxRxRcvError = 0;
    		++uxRxRcvError;
        }
        if( READ_BIT( xRxLastDesc, ETH_RECEIVE_OVERFLOW ) != 0 )
        {
        	static size_t uxRxROError = 0;
    		++uxRxROError;
        }
        if( READ_BIT( xRxLastDesc, ETH_WATCHDOG_TIMEOUT ) != 0 )
        {
        	static size_t uxRxWDTError = 0;
    		++uxRxWDTError;
        }
        if( READ_BIT( xRxLastDesc, ETH_GIANT_PACKET ) != 0 )
        {
        	static size_t uxRxGPError = 0;
    		++uxRxGPError;
        }
        if( READ_BIT( xRxLastDesc, ETH_CRC_ERROR ) != 0 )
        {
        	static size_t uxRxCRCError = 0;
    		++uxRxCRCError;
        }
    }
}

/*---------------------------------------------------------------------------*/

static void prvHAL_DMA_ErrorCallback( ETH_HandleTypeDef * pxEthHandle )
{
	#ifdef niEMAC_STM32HX
	{
		const uint32_t ulDmaError = pxEthHandle->DMAErrorCode;
        #ifdef niEMAC_STM32HX
    		if( ( ulDmaError & ETH_DMA_RX_ERRORS_MASK ) != ETH_DMA_RX_NO_ERROR_FLAG )
    		{
    			/* if( ( ulDmaError & ETH_DMA_RX_ERRORS_MASK ) == ETH_DMA_RX_DESC_READ_ERROR_FLAG )
    			{
    				static size_t uxDmaRDRError = 0;
    				++uxDmaRDRError;
    			}
    			else if( ( ulDmaError & ETH_DMA_RX_ERRORS_MASK ) == ETH_DMA_RX_DESC_WRITE_ERROR_FLAG )
    			{
    				static size_t uxDmaRDWError = 0;
    				++uxDmaRDWError;
    			}
    			else if( ( ulDmaError & ETH_DMA_RX_ERRORS_MASK ) == ETH_DMA_RX_BUFFER_READ_ERROR_FLAG )
    			{
    				static size_t uxDmaRBRError = 0;
    				++uxDmaRBRError;
    			}
    			else if( ( ulDmaError & ETH_DMA_RX_ERRORS_MASK ) == ETH_DMA_RX_BUFFER_WRITE_ERROR_FLAG )
    			{
    				static size_t uxDmaRBWError = 0;
    				++uxDmaRBWError;
    			} */
    		}
    		if( ( ulDmaError & ETH_DMA_TX_ERRORS_MASK ) != ETH_DMA_TX_NO_ERROR_FLAG )
    		{
    			/* if( ( ulDmaError & ETH_DMA_TX_ERRORS_MASK ) == ETH_DMA_TX_DESC_READ_ERROR_FLAG )
    			{
    				static size_t uxDmaTDRError = 0;
    				++uxDmaTDRError;
    			}
    			else if( ( ulDmaError & ETH_DMA_TX_ERRORS_MASK ) == ETH_DMA_TX_DESC_WRITE_ERROR_FLAG )
    			{
    				static size_t uxDmaTDWError = 0;
    				++uxDmaTDWError;
    			}
    			else if( ( ulDmaError & ETH_DMA_TX_ERRORS_MASK ) == ETH_DMA_TX_BUFFER_READ_ERROR_FLAG )
    			{
    				static size_t uxDmaTBRError = 0;
    				++uxDmaTBRError;
    			}
    			else if( ( ulDmaError & ETH_DMA_TX_ERRORS_MASK ) == ETH_DMA_TX_BUFFER_WRITE_ERROR_FLAG )
    			{
    				static size_t uxDmaTBWError = 0;
    				++uxDmaTBWError;
    			} */
    		}
            if( ( ulDmaError & ETH_DMA_CONTEXT_DESC_ERROR_FLAG ) != 0 )
            {
                static size_t uxDmaCDError = 0;
                ++uxDmaCDError;
            }
        #endif
		if( ( ulDmaError & ETH_DMA_FATAL_BUS_ERROR_FLAG ) != 0 )
		{
			static size_t uxDmaFBEError = 0;
			++uxDmaFBEError;
		}
		if( ( ulDmaError & ETH_DMA_EARLY_TX_IT_FLAG ) != 0 )
		{
			static size_t uxDmaETIError = 0;
			++uxDmaETIError;
		}
		if( ( ulDmaError & ETH_DMA_RX_WATCHDOG_TIMEOUT_FLAG ) != 0 )
		{
			static size_t uxDmaRWTError = 0;
			++uxDmaRWTError;
		}
		if( ( ulDmaError & ETH_DMA_RX_PROCESS_STOPPED_FLAG ) != 0 )
		{
			static size_t uxDmaRPSError = 0;
			++uxDmaRPSError;
		}
		if( ( ulDmaError & ETH_DMA_RX_BUFFER_UNAVAILABLE_FLAG ) != 0 )
		{
			static size_t uxDmaRBUError = 0;
			++uxDmaRBUError;
		}
		if( ( ulDmaError & ETH_DMA_TX_PROCESS_STOPPED_FLAG ) != 0 )
		{
			static size_t uxDmaTPSError = 0;
			++uxDmaTPSError;
		}
	}
	#endif /* ifdef niEMAC_STM32HX */
}

